vegeta-cli/src/vegeta/aeromant/templates/jet_external/com/0.orig/exhaust
/*--------------------------------*- C++ -*----------------------------------*\
  Aeromant template case — values in {{...}} are inserted by aeromant.prepare()
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      exhaust;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    sides
    {
        type            zeroGradient;
    }
    "(body|intake).*"
    {
        type            zeroGradient;
    }
    "exhaust.*"
    {
        type            fixedValue;
        value           uniform 1;
    }
}

// ************************************************************************* //
