vegeta-cli/src/vegeta/aeromant/templates/jet_external/com/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  Aeromant template case — values in {{...}} are inserted by aeromant.prepare()
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform {{PRESSURE}};

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform {{PRESSURE}};
    }
    sides
    {
        type            slip;
    }
    "(body|intake|exhaust).*"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
