vegeta-cli/src/vegeta/aeromant/templates/jet_external/com/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  Aeromant template case — values in {{...}} are inserted by aeromant.prepare()
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    ({{XMIN}} {{YMIN}} {{ZMIN}})
    ({{XMAX}} {{YMIN}} {{ZMIN}})
    ({{XMAX}} {{YMAX}} {{ZMIN}})
    ({{XMIN}} {{YMAX}} {{ZMIN}})
    ({{XMIN}} {{YMIN}} {{ZMAX}})
    ({{XMAX}} {{YMIN}} {{ZMAX}})
    ({{XMAX}} {{YMAX}} {{ZMAX}})
    ({{XMIN}} {{YMAX}} {{ZMAX}})
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ({{NX}} {{NY}} {{NZ}}) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces ((0 4 7 3));
    }
    outlet
    {
        type patch;
        faces ((1 2 6 5));
    }
    sides
    {
        type patch;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
