vegeta-cli/src/vegeta/aeromant/templates/jet_external/com/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  Aeromant template case — values in {{...}} are inserted by aeromant.prepare()
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.05;
    }
    "(U|h|k|omega|exhaust)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    consistent      yes;
    transonic       {{TRANSONIC}};
    pMinFactor      0.5;
    pMaxFactor      2.0;

    residualControl
    {
        p               {{RESIDUAL_TARGET}};
        "(U|h|k|omega)"   {{RESIDUAL_TARGET}};
    }
}

relaxationFactors
{
    fields
    {
        p               0.3;
        rho             0.05;
    }
    equations
    {
        U               0.7;
        h               0.7;
        ".*"            0.7;
    }
}

// ************************************************************************* //
